type Variable = string;
type Divisor = number;

export interface Question {
    mods: Record<Variable, Divisor>;
    number: number;
    question: string;
}

export const questions = {
    1: [
        { "mods": {}, "number": 1, "question": "\\text{Дійсна та уявна частини комплексного числа.}" },
        { "mods": {}, "number": 2, "question": "\\text{Модуль та аргумент комплексного числа (у тому числі - нюанс щодо аргумента нуля).}" },
        { "mods": {}, "number": 3, "question": "\\text{Формула Муавра.}" },
        { "mods": {}, "number": 4, "question": "\\text{Формули зв'язку модуля та аргумента з дійсною та уявною частинами.}" },
        { "mods": {}, "number": 5, "question": "\\text{Тригонометрична форма комплексного числа.}" },
        { "mods": {}, "number": 6, "question": "\\text{Спряжене та його властивості.}" },
        { "mods": {}, "number": 7, "question": "\\text{Бінарна операція.}" },
        { "mods": {}, "number": 8, "question": "\\text{Нейтральний елемент.}" },
        { "mods": {}, "number": 9, "question": "\\text{Правила дистрибутивності в означенні кільця поля.}" },
        { "mods": {}, "number": 10, "question": "\\text{Означення гіперболи.}" },
        { "mods": {}, "number": 11, "question": "\\text{Ексцентриситет КДП і властивості кожного з них (який > 1, який < 1, який = 1).}" },
        { "mods": {}, "number": 12, "question": "\\text{Фокальний радіус еліпса.}" },
        { "mods": {}, "number": 13, "question": "\\text{Канонічні системи координат для еліпса, гіперболи, параболи.}" },
        { "mods": {}, "number": 14, "question": "\\text{Абелева (комутативна) група.}" },
        { "mods": {}, "number": 15, "question": "\\text{Напівгрупа.}" },
        { "mods": {}, "number": 16, "question": "\\text{Кільце.}" },
        { "mods": {}, "number": 17, "question": "\\text{Можлива кількість розвʼязків СЛР та наслідок про кількість розвʼязків у СЛР з більшою кількістю змінних, ніж рівнянь.}" },
        { "mods": {}, "number": 18, "question": "\\text{Наслідки про кількість розвʼязків однорідної СЛР.}" },
        { "mods": {}, "number": 19, "question": "\\text{Характеристики векторного простору } V \\text{ над полем } F." },
        { "mods": {}, "number": 20, "question": "\\text{Лінійна комбінація.}" },
        { "mods": {}, "number": 21, "question": "\\text{Твірна система векторів.}" },
        { "mods": {}, "number": 22, "question": "\\text{ЛНЗ та ЛЗ системи векторів.}" },
        { "mods": {}, "number": 23, "question": "\\text{Базис.}" }
    ],
    2: [
        { "mods": { "k": 5 }, "number": 1, "question": "\\text{Кільце, яке містить число } \\frac{1}{${k}} \\text{, але НЕ є полем.}" },
        { "mods": { "a": 10, "b": 11 }, "number": 2, "question": "\\text{Квадратне рівняння з дійсними коефіцієнтами, для якого } z = ${a} + ${b}i \\text{ є коренем.}" },
        { "mods": { "k": 8 }, "number": 3, "question": "\\text{Комплексне число } z \\text{, що задовольняє } z^{${k}} = \\bar{z}." },
        { "mods": {}, "number": 4, "question": "\\text{Несумісна СЛР, у якої рівнянь менше, ніж змінних, без пропорційних рівнянь.}" },
        { "mods": {}, "number": 5, "question": "\\text{Сумісна СЛР, у якої рівнянь більше, ніж змінних, без пропорційних рівнянь.}" },
        { "mods": { "k": 4 }, "number": 6, "question": "\\text{Моноїд, але НЕ група, містить нескінченну кількість елементів, але НЕ містить число } ${k}." },
        { "mods": {}, "number": 7, "question": "\\text{Кільце, яке НЕ є полем і має скінченну кількість елементів.}" },
        { "mods": {}, "number": 8, "question": "\\text{Множина векторів } V \\text{ та поле } F \\text{, такі що } V \\text{ НЕ є векторним простором над } F." },
        { "mods": {}, "number": 9, "question": "\\text{Різні нетривіальні лінійні комбінації однієї системи векторів, які дають однаковий результат.}" }
    ],
    3: [
        { "mods": {}, "number": 1, "question": "\\text{Модуль добутку комплексних = добуток модулів, аргумент добутку = сума аргументів.}" },
        { "mods": {}, "number": 2, "question": "\\text{Рівняння } z^n = w \\text{ має рівно } n \\text{ комплексних коренів, якщо } w \\neq 0." },
        { "mods": {}, "number": 3, "question": "\\text{Метод Гаусса зведення СЛР до східчастої форми.}" },
        { "mods": {}, "number": 4, "question": "\\text{Розвʼязування СЛР, зведеної до східчастої форми (як розвʼязувати, коли скільки розвʼязків).}" },
        { "mods": {}, "number": 5, "question": "\\text{Властивості ЛЗ, ЛНЗ та твірної системи векторів.}" },
        { "mods": {}, "number": 6, "question": "\\text{Відношення відстані від точок гіперболи до фокусів та односторонньої з цими фокусами директриси.}" },
        { "mods": {}, "number": 7, "question": "\\text{Вивід рівняння параболи.}" }
    ],
    4: [
        { "mods": {}, "number": 1, "question": "\\text{Система } (v_1, v_2, \\cdots, v_n) \\text{ твірна } \\Rightarrow \\forall (n + 1) \\text{ вектор ЛЗ.}" },
        { "mods": {}, "number": 2, "question": "\\text{Вивід формули рівняння еліпсу (в обидва боки).}" },
        { "mods": {}, "number": 3, "question": "\\text{Вивід формули рівняння гіперболи (в обидва боки).}" },
        { "mods": {}, "number": 4, "question": "\\text{Три еквівалентні означення базису.}" },
    ]
};

